[{"content":"Locomotion Technique When we think about locomotion techniques, there are several metrics that need to be considered. The one I wanted to focus on was the \u0026amp;ldquo;Reduction of Cybersickness\u0026amp;rdquo;. When I tried VR for the first time I realised that I myself am very susceptible to cybersickness and that gave me the idea of reducing this sickness as much as possible. The first few things that came to my mind were:\nMove physically or teleport Controller (joystick) shouldn\u0026amp;rsquo;t control the camera Add nose Framerate \u0026amp;gt; 90 FPS Only teleportation and the second option made it into the final version. Why did I not choose to move physically? The answer is simple. We were given the restriction of implementing a locomotion technique that can even be used in confined spaces. Additionally I am very confident that teleportation is less susceptible to cybersickness than moving in place, since moving in place would still create an illusory self-motion in the absence of physical self-motion (vection). In the following picture you can see my locomotion concept:\nIdea ball \u0026amp;amp; teleportation The player can throw a ball to collect coins. If the ball collides with the ground it creates a portal. The player can activate the portal to teleport to the portals position. After activation the portal disappears. I wanted to have some kind of theme that would fit well with my locomotion technique. It took a while to think of something suitable, but in the end I decided to go with a winter theme. The ball thrown by the player shall be a snowball and I wanted to include other things, which will be explained later on, so that the player feels more present. Interaction Task Of course, the winter theme should also be maintained for the interaction task. My idea for the interaction task was to build a snowman instead of fitting the two T-shaped objects. The next image shows my concepts:\nThe interaction task consists of 3 phases.\n1.Phase: Attach the carrot (nose). 2.Phase: Attach the branch (left …","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"237538c910909c1675111173c3cc027f","permalink":"https://Lithanel.github.io/Lithanel_page/idea-approach/","publishdate":"2023-02-18T09:46:32+01:00","title":"Idea \u0026 Approach"},{"content":"Surprisingly, the most time of the project I spent on the Interaction Task. It took several Bugfixes and adjustments to create a proper system, which doesn\u0026amp;rsquo;t throw any errors and is fun to play. In this chapter I will explain how I implemented the Interaction Task in my project.\nFirst of all I created some models:\nCarrot (Nose) The carrot and the branches have two important collider. The right collider and the *wrong collider. I will explain in a moment what these colliders are good for.\nTwo Branches (Arms) Snowman The snowman model has three sphere collider that check if the nose and arms are thrown the right way around (image: green arrows). If the objects wrong collider collides with the snowmans collider first than the object respawn at the start position and it is registered as a failed throw. If the objects right collider collides with the snowmans collider first and additionally collides with the head or body (depends on the object) than the object will be attached on the snowman. The pre-attached transparent carrot and branch objects are supposed to serve as a orientation for the player. Idle Interaction Portal The Idle Interaction Portal changes to an Activated Interaction Portal as soon as a snowball hits the portal. Activated Interaction Portal This portal has the same functionality as the smaller version of it. The only difference is that the player can activate the interaction task by teleporting to this portal.\nInteraction Portal This is how the Interaction Portal works: It\u0026amp;rsquo;s impossible to create portals during interaction tasks.\nInteraction Buttons The standard parkour already contained interaction button, but I wanted the player only to interact with the snowball, carrot and branches. This is the reason that I increased the size of the buttons and made it possible for the player to interact with them by throwing the snowball at them. As mentioned in chapter Idea \u0026amp;amp; Approach the interaction task consist of three phases. Every phase can …","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"79fcdcadf82cbe20512599df88bf278b","permalink":"https://Lithanel.github.io/Lithanel_page/interaction-task/","publishdate":"2023-02-18T09:46:32+01:00","title":"Interaction Task"},{"content":"In the Wintersemester 2022/2023 I decided to participate in the module \u0026amp;ldquo;Interaction in Virtual and Augmented Reality\u0026amp;rdquo;. It only had 15 open spaces, so I am very greatful that I was given one of those. It was very good experience and I can say with confident that my Unity skills greatly improved.\nThe device we were provided with was the \u0026amp;ldquo;Oculus Quest 2\u0026amp;rdquo;:\nOculus Quest 2 We were free to use any unity assets we wanted, but I decided to stay with the Oculus Integration. You can find the asset through this link: https://assetstore.unity.com/packages/tools/integration/oculus-integration-82022 We were given the task to implement a locomotion and also an interaction technique, which we had to include in a given VR-environment. It was a pre-implemented parkour which we were supposed to improve and adapt. Here are a few screenshots of the standard parkour:\nStandard parkour Standard parkour (other side) Standard parkour (from above) The goal of the parkour is to make a lap using our self implemented locomotion techniques. The player was also supposed to be able to collect coins during the run. We were also assigned to implement an interaction technique, which was to be included in the following locations.\nInteraction tasks locations Standard Interaction Task The interaction task in standard parkour looks like this:\nThe interaction task includes two T-shaped objects. One is more transparent than the other. The player can grab the opaque object. The player must place the opque object on top of the transparent object. The time and the accuracy are measured. ","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"4e1314de3ce8f7346ff7c2261dcc8b15","permalink":"https://Lithanel.github.io/Lithanel_page/introduction/","publishdate":"2023-02-18T09:46:32+01:00","title":"Introduction"},{"content":"Since I decided on the winter theme and to give the player the impression that they are in a winter landscape, the first thing i wanted to do was cover everything with snow. Therefore we used something integrated in Unity, which called \u0026amp;ldquo;Shader Graph\u0026amp;rdquo;. I have oriented myself on this youtube video from Brackeys: https://youtu.be/IC9g5hlfV6o\nThis was my first try:\nThe shader was not working correctly and instead of covering only the top side of an object, it covered the whole object in snow, which made totally white. The youtube video contained a little older version, which was the reason for this error and after a fix the house looked like this.\nMuch better :) As you can see in the result image the snow only lies on the top layer of the object. This was possible thanks to a raycast from above. The next image contains my Shader Graphs for the snow layer:\nSnow layer (Shader Graphs) Parkour Before The result is like day and night. The environment looks totally different: Parkour After Eye Error During implementing my project I stumbled upon this error. This error causes you to see different scenes with both eyes and can be easily fixed by changing the Stereo Rendering Mode to Multi Pass instead of Single Pass Instanced.\nLeft Eye Vision Right Eye Vision Error Fix ","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"f3a8f62a6a16510da34288a354434c6a","permalink":"https://Lithanel.github.io/Lithanel_page/snow-landscape/","publishdate":"2023-02-18T09:46:32+01:00","title":"Snow landscape"},{"content":"Snowball Spawn Until now the snowball spawned at a designated location, which is not what we want. We want the snowball spawner to move and rotate with the player. I tried to implement something similar to this video (https://youtu.be/FFM2oyLUysk) and partly succeeded. The only thing I failed at was to move the spawn slightly to the players right side, but now the snowball always spawns at the players hip area and also moves and turns around with the player.\nCollect Coins To collect coins you have to watch for collisions just like with the teleporter. For the coins i created a seperate tag to ask for it in case of a collision. If the snowball collides with the coin the coin will be deactivated and the coin counter will be increased by one.\nThis is how the result looks like: ","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"17a8cc5a3b53a3d7e5a2b3d254ff6d17","permalink":"https://Lithanel.github.io/Lithanel_page/snowball-spawn-coins/","publishdate":"2023-02-18T09:46:32+01:00","title":"Snowball Spawn \u0026 Coins"},{"content":"Snowing To increase the chances that the player feels present in the snow landscape I wanted to add a snowing animation. Therefore I used the Unity Particle System. I found a good tutorial on youtube (https://youtu.be/4wzubisvcyI) and tried to implement into my parkour. I made the mistake of trying to apply the particle system to the whole parkour. The system could not keep up with the creation of the particles and there were also some performance issues. In the end there was not enough snow falling down. I realized I it only had to snow close to the player, so I made a smaller particle area and attached it to the player. This is the result: Snowball Visibility One problem i had to deal with was that the snowball was hard to detect in the snowy landscape. I mean it\u0026amp;rsquo;s a white object on a white background\u0026amp;hellip; There were two things I added into my project to make the snowball more visible in case of grabbing and in case of throwing the ball.\nOutline I found a very good free asset in the unity asset store to highlight the snowball in case the player grabs it.\nHere is the link to the asset called Quick Outline: https://assetstore.unity.com/packages/tools/particles-effects/quick-outline-115488\nI just had to make sure that the provided script is activated as soon as the snowball was grabbed. The asset Oculus Integration, which we mentioned in the introduction, has a script named OVRGrabbable.cs that contains two functions called GrabBegin and GrabEnd. These functions can be used to find out when the snowballs are grabbed and the outline can be activated/deactivated accordingly.\nTrail Renderer To ensure that the ball does not merge with the landscape and becomes invisible to the players eyes, I used something called Trail Renderer. This feature is included in unity and can be used by adding this component to an object. I found this very short, but informative tutorial and added it to my project: https://www.youtube.com/watch?v=9PqPZDqSDWA In the following picture …","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"d2203c0b30818e491f27042acc430eb6","permalink":"https://Lithanel.github.io/Lithanel_page/snowing-and-snowball-visibility/","publishdate":"2023-02-18T09:46:32+01:00","title":"Snowing and Snowball Visibility"},{"content":"Now that we have the throwing function, we can start implementing the teleport system. What exactly do we need?\nA portal is created at the point of impact of the snowball. Buildings and objects don\u0026amp;rsquo;t count. If the snowball collides with a coin, the coin is collected. Ball is not interrupted. The player can press a button to teleport to the portals location. Teleporter disappears when used. First of all we need a model for the portal. This is the model I came up with:\nThe teleporter is visible even from a distance thanks to the height of the column.\nThe portal is supposed to appear as soon as the the snowball hits the ground. For this purpose I used collider.\nSnowball Collider \u0026amp;amp; Rigidbody The snowball needs to have a Continuous Collision Detection, otherwise in too many cases the ball will fly through objects without being detected. The Trigger will be activated the moment the object is realeased from the hand.\nGround Collider The standard parkour contains street tiles with mesh colliders. The Collider should be set Convex to increase the change of the snowball being detected. In cases like the curve tiles the colliders were not set to Convex, since the portal would float in the air. I set the Rigidbody to Kinematic and activated all the Constraints, as the ground tiles should be not moveable. This image shows the collider of a curve tile. The Mesh Collider is set to convex. If you look at the error you can see that the colliders height is too high compared to the ground in the foreground, which has the consequence that the portal floats in the air.\nErrors Collision Detection Error These are my attempts creating the portal without setting the Mesh Collider to Convex.\nThe snowball just disappear into the ground, since some collisions are not detected properly. There were still some snowballs disappearing without creating a portal, even with the Mesh Colliders set to convex.\nThis problem was solved by creating a big platform underneath the map to catch the …","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"7f35bc68c68ef72e3e8348bc57b033e7","permalink":"https://Lithanel.github.io/Lithanel_page/teleporter/","publishdate":"2023-02-18T09:46:32+01:00","title":"Teleporter"},{"content":"In this chapter I talk about the throwing method. The throwing method was done by Karl Lewis. I used a lot of his code and approach, so please check out his website if you want to learn how to implement it yourself or maybe you want to know more about the mathematical background. https://karllewisdesign.com/how-to-improve-throwing-physics-in-vr/\nI will just briefly summarize the approach I used. The Oculus Integration Unity Asset already has a grab and release function, but the problem is that it feels very unnatural to throw objects with it. So I just made a few adjustments to my project to make whole process a bit smoother. Here are some important points to pay attention to:\nThe center of mass of the controller. The linear and angular velocity of the controller. These are the two important lines, which made this whole throwing process a lot smoother and natural. The linear and angular velocity have to be considered to get the full throwing velocity, else the throw would neither be accurate nor would it be long.\nVector3 controllerVelocityCross = Vector3.Cross(angularVelocity, m_grabbedObjectPosOff - controllerCenterOfMass); Vector3 fullThrowVelocity = (linearVelocity + cross) * ballSpeed; controllerCenterOfMass = the center of mass of the controller angularVelocity = angular velocity of the controller linearVelocity = linear velocity of the controller controllerVelocityCross = cross ballSpeed = manually inserted number to adjust the velocity First Throw This is one of the first throws I tested on my project: Yes, the snowball is black and i promise you it won\u0026amp;rsquo;t stay like this. :)\nHigher Velocity (ballSpeed) In this prototype I tried out increasing the variable ballSpeed. The snowball flew much further than in the previous version.\nFunny Bug This is a funny bug I found from one of my tests. I can\u0026amp;rsquo;t exactly remember what caused this, but I thought it was good enough to add this here. :D ","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"02eaa51fb0392d1ef7b4b40eb881b3fe","permalink":"https://Lithanel.github.io/Lithanel_page/throwing/","publishdate":"2023-02-18T09:46:32+01:00","title":"Throwing"},{"content":"Interaction in Virtual and Augmented Reality Snowball Parkour Welcome to my university VR-Project about locomotion and interaction. My name is Kyu Hwan Yoo and I am currently doing my Master\u0026amp;rsquo;s degree at the Technical university Darmstadt. In this blog I will guide you through my development journey and I hope to give you a good insight about my ideas and struggles. So let\u0026amp;rsquo;s not waste any more and get started right away.\n","date":1676547005,"description":"","lastmod":"2023-02-16T12:30:05+01:00","objectID":"3976528693a0108357f4928017600865","permalink":"https://Lithanel.github.io/Lithanel_page/","publishdate":"2023-02-16T12:30:05+01:00","title":"Home_title"}]