[{"content":"Locomotion Technique When we think about locomotion techniques, there are several metrics that need to be considered. The one I wanted to focus on was the \u0026amp;ldquo;Reduction of Cybersickness\u0026amp;rdquo;. When I tried VR for the first time I realised that I myself am very susceptible to cybersickness and that gave me the idea of reducing this sickness as much as possible. The first few things that came to my mind were:\nMove physically or teleport Controller (joystick) shouldn\u0026amp;rsquo;t control the camera Add nose Framerate \u0026amp;gt; 90 FPS Only teleportation and the second option made it into the final version. Why did I not choose to move physically? The answer is simple. We were given the restriction of implementing a locomotion technique that can even be used in confined spaces. Additionally I am very confident that teleportation is less susceptible to cybersickness than moving in place, since moving in place would still create an illusory self-motion in the absence of physical self-motion (vection). In the following picture you can see my locomotion concept:\nIdea ball \u0026amp;amp; teleportation The player can throw a ball to collect coins. If the ball collides with the ground it creates a portal. The player can activate the portal to teleport to the portals position. After activation the portal disappears. I wanted to have some kind of theme that would fit well with my locomotion technique. It took a while to think of something suitable, but in the end I decided to go with a winter theme. The ball thrown by the player shall be a snowball and I wanted to include other things, which will be explained later on, so that the player feels more present. Interaction Task Of course, the winter theme should also be maintained for the interaction task. My idea for the interaction task was to build a snowman instead of fitting the two T-shaped objects. The next image shows my concepts:\nThe interaction task consists of 3 phases.\n1.Phase: Attach the carrot (nose). 2.Phase: Attach the branch (left …","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"237538c910909c1675111173c3cc027f","permalink":"https://Lithanel.github.io/Lithanel_page/idea-approach/","publishdate":"2023-02-18T09:46:32+01:00","title":"Idea \u0026 Approach"},{"content":"In the Wintersemester 2022/2023 I decided to participate in the module \u0026amp;ldquo;Interaction in Virtual and Augmented Reality\u0026amp;rdquo;. It only had 15 open spaces, so I am very greatful that I was given one of those. It was very good experience and I can say with confident that my Unity skills greatly improved.\nThe device we were provided with was the \u0026amp;ldquo;Oculus Quest 2\u0026amp;rdquo;:\nOculus Quest 2 We were given the task to implement a locomotion and also an interaction technique, which we had to include in a given VR-environment. It was a pre-implemented parkour which we were supposed to improve and adapt. Here are a few screenshots of the standard parkour:\nStandard parkour Standard parkour (other side) Standard parkour (from above) The goal of the parkour is to make a lap using our self implemented locomotion techniques. The player was also supposed to be able to collect coins during the run. We were also assigned to implement an interaction technique, which was to be included in the following locations.\nInteraction tasks locations Standard Interaction Task The interaction task in standard parkour looks like this: The interaction task includes two T-shaped objects. One is more transparent than the other. The player can grab the opaque object. The player must place the opque object on top of the transparent object. The time is and the accuracy is measured. ","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"4e1314de3ce8f7346ff7c2261dcc8b15","permalink":"https://Lithanel.github.io/Lithanel_page/introduction/","publishdate":"2023-02-18T09:46:32+01:00","title":"Introduction"},{"content":"Since I decided on the winter theme and to give the player the impression that they are in a winter landscape, the first thing i wanted to do was cover everything with snow. Therefore we used something integrated in Unity, which called \u0026amp;ldquo;Shader Graph\u0026amp;rdquo;. I have oriented myself on this youtube video from Brackeys: https://youtu.be/IC9g5hlfV6o\nThis was my first try:\nThe shader was not working correctly and instead of covering only the top side of an object, it covered the whole object in snow, which made totally white. The youtube video contained a little older version, which was the reason for this error and after a fix the house looked like this.\nMuch better :) As you can see in the result image the snow only lies on the top layer of the object. This was possible thanks to a raycast from above. The next image contains my Shader Graphs for the snow layer:\nSnow layer (Shader Graphs) The result is like day and night. The environment looks totally different:\nParkour Before Parkour After Eye Error ","date":1676709992,"description":"","lastmod":"2023-02-18T09:46:32+01:00","objectID":"6a7e89250e97d7a4e3c4e32316285dbf","permalink":"https://Lithanel.github.io/Lithanel_page/snow-landscape-implementation/","publishdate":"2023-02-18T09:46:32+01:00","title":"Snow landscape (Implementation)"},{"content":"Interaction in Virtual and Augmented Reality Snowball Parkour Welcome to my university VR-Project about locomotion and interaction. My name is Kyu Hwan Yoo and I am currently doing my Master\u0026amp;rsquo;s degree at the Technical university Darmstadt. In this blog I will guide you through my development journey and I hope to give you a good insight about my ideas and struggles. So let\u0026amp;rsquo;s not waste any more and get started right away.\n","date":1676547005,"description":"","lastmod":"2023-02-16T12:30:05+01:00","objectID":"3976528693a0108357f4928017600865","permalink":"https://Lithanel.github.io/Lithanel_page/","publishdate":"2023-02-16T12:30:05+01:00","title":"Home_title"}]